{
  "roles": {
    "productOwner": "Produktägaren sammanställer och prioriterar önskemål för att maximera det värde för det som ska leverareras av utveckligsteamet. Detta sker genom en så kallad produktbacklog, mer om det längre ner. Viktigt att produktägaren kan motstå eventuella frestelser att deatljstyra projektet, utan vara villig att släppa ifrån sig visst ansvar till teamet. ",
    "scrumMaster": "En Scrum Master ser till att ramverket för Scrum följs samtidigt som hen driver teamet mot ständig förbättring och utveckling. Scrum Mastern jobbar både mot utvecklingsteamet (Scrum Team) och mot produktägaren. Det är en viktig roll för att hålla projektet på rätt bana, vilket är avgörande för att lyckas med Scrumprocessen. Man kan se Scrum Mastern lite som en projektledare, som leder dagliga scrummöten, sprintplanering, granaskning och återblickar. Allt detta förklaras i avsnittet om aktiviteter.   ",
    "scrumTeam": "Ett Scrum team är självorganiserande och bestämmer gemensamt vem som gör vad och hur man löser de olika uppgifterna man fått av produktägaren i form av en produktbacklog. Teamet består av en grupp tätt samarbetande människor, normalt mellan 5-9 personer."
  },
  "about": "Scrum är en form av metodik för systemutveckling, en agil struktur som hjälper team att samarbeta och effektivt utföra viktigt arbete. Istället för en klassisk kravspecifikation använder man istället en så kallad <a onClick={document.getElementById('backlog').scrollIntoView()} class='link'>backlog</a>",
  "history": "Scrum är en term från rugby. Det är en tät, axel mot axel formation som laget använder för att föra bollen framåt när den sätts i spel. De japanska management forskarna Hiro... myntade uttrycket. De såg scrum som en bra liknelse för tvärfunktionella team som arbetar på liknande sätt för att göra klart produkter. Scrum skapades ursprungligen av Jeff Sutherland och Ken Schuwaber.",
  "artefacts": {
    "about": "För att alla inblandande i scrum processen ska kunna dokumentera och visualisera arbetet så används så kallade artefakter. Dessa artefakter är något man skapar, som ett verktyg för att lösa problem. Det finns tre artefakter i Scrum: produktbacklog, sprintbacklog och produktinkrement.",
    "backlog": "Istället för en klassisk kravspecifikation använder man i Scrum istället en så kallad backlog. Backlog, eller produktbacklog, är en prioriterad lista (likt en önskelista) med alla önskemål om prudukten. Den som prioriterar och ansvarar för backlogen är produktägaren. Varje önskemål prioriteras efter vad som ger mest värde. Dock är det viktigt att komma ihåg att denna lista inte är skriven i sten, och kan alltså komma att ändras/uppdateras. Önskemål kan falla bortm prioriteras ner och nya önskemål kan läggas till. En backlog skrivs ofta i form av user stories som är uppbyggda såhär:",
    "sprintBacklog": "En del av produktbacklogen som teamet åtar sig att implementera under en sprint. Tänk på det som en att göra-lista, där man plockar ut delar av backlogen som skapar <a class='link' onClick={document.getElementById('inkrement').scrollIntoView()}>inkrement</a>",
    "inkrement": "Inkrement är den samlade produkt som uppstår efter en Sprint, men även värdet av inkrementen från alla föregående sprintar.  I slutet av en sprint måste det nya inkrementet vara 'klart', vilket betyder att det måste vara i användarbart skick. Det kan vara en ny produkt eller funktion, en förbättring ellr en buggfix, eller något annat beroende på teamet. Inkrementet presenteras sedan i <a class='link' onClick={document.getElementById('sprintReview').scrollIntoView()}>Sprint Review</a> i slutet av sprinten."
  },
  "sprint": "Sprint är vad den agila filosofin kallar en iteration, något som upprepas tills en slutprodukt eller annat mål är nått. Hela arbetet/projektet delas in i sprintar. En sprint är alltid tidsbestämd, t ex ett par veckor, och börjar med ett planeringsmöte (Sprint Planning) och avslutas med en demostration och genomgång av det som utvecklats under sprinten (Sprint Review). Under sprinten sker dagliga Daily Scrums (korta möten) och sist i en sprint görs en återblick för att se om det finns något som kan förändras/ göras bättre till nästa sprint (Sprint Retrospective).",
  "sprintPlanning": "Varje sprint inleds med en sprintplanering. Här går teamet tillsammans med Produktägaren igenom backlogen och beslutar vad som kan genomföras och hur. Teamet besvara frågor om vad och hur, medan Produktägarens roll är att svara på frågor som kan uppstå kring specifika uppgifter i backlogen. Det behövs under sprintplaneringen skapas ett Sprintmål som definerar vad arbetet i denna Sprint ska leda till. Ett exempel på detta kan vara 'Efter denna sprint skall användare kunna söka på varor på våran hemsida med hjälp av ett sökfält'. Allt det som teamet tror sig hinna med under Sprinten blir dokumenterat i en <a onClick={document.getElementById('sprintBacklog').scrollIntoView()}>Sprintbacklog</a>",
  "sprintReview": "Teamet anordnar i slutet av en Sprint en Sprint Review för att kommuncera för Scrum Master, produktägare och andra intressenter den utvecklign som skett under Sprinten. Sprint Review kallas ibland även för ceremoni eller Sprint Demo, och har som syfte att förklara var teamet gjort under sprinten, vad som inte gjorts och hur detta påverkar kommande sprint. ",
  "dailyScrum": "Daily Scrum är ett planeringsmöte som Scrumteamet har varje dag. Mötet ska hållas kort, högst 15 min, och för att det inte ska dra ut på tiden brukar man göra dessa stående (stand ups). Alla deltagare i mötet ska svara kort på tre frågor: Vad har jag gjort sedan senaste mötet? Vad planerar jag att göra idag? Har jag några hinder? Med denna informationen kan teamet planera dagen fram till nästa Daily Scrum. Scrum Master och Produktägaren får vara med på mötet men de bör inte delta aktivt, utan bara lyssna.",
  "sprintRetrospective": "Teamet, Scrum Master och Produktägare går tillsammans igenom erfarenheter från sprinten och indentifierar förbättringar till kommande sprint. Det kan handla om arbetssätt, verktyg, relationer och annat som kommer upp som behöver kollas över. Det är viktigt att upptäcka eventuella problem tidigt så att de kan åtgärdas innan de blivit för stora. Resultaten från retrospektiv bör var små och konkreta förändringar. Detta är även ett gyllene tillfälle att lyfta teamets styrkor och positiva erfareheter från Sprinten. ",
  "agilEstimering": "Agil estimering är ett sätt att skapa en gemensam uppfattning om ett teams prestation under exempelvis en iteration. Men det handlar också om hur stor/komplex t ex en user story är. För varje user story bör man kunna Estimera hur pass komplex uppgiften är. Detta är lättare att göra för team som jobbat ihop under en lägnre team, men såklart svårt för de som aldrig gjort det. Det viktigaste att ta med sig i denna process är att om vi inte vet så gissar vi, och när vi gissar tar vi alltid till i överkant. <br/> Med Agil Estimering pratar man om Ideal Days eller Story Points. Ideal Days är dagar när du endast jobbar med uppgiften (alltiså inte har några andra åtagnaden), du har även allt du behöver för att klara en uppgift och du blir aldrig störd. Hur många dagar tar det ett team att färdigställa en user story under helt optimala förhållanden? När man använder Story Points så estimerar man istället t ex en User Story med hjälp av en skala ( i många fall Fibonacci skalan- 1,2,3,5,8,13,21...) där man indikerar storleken på en uppgift relativt med andra, oftast en bas-story som man väljer ut först. På så sätt kan man istället estimera storleken på en uppgift i relation till andra uppgifter."
}
